<?php
    error_reporting(1);
    spl_autoload_register(function ($class) { include __DIR__."/Classes/".$class.".php"; });

    $status = [ "Worker", "Director", "Manager", "Programmer", "Tester" ];
    $st = ["w", "d", "m", "p", "t" ];
    $objects = [ "w" => [], "d" => [], "m" => [], "p" => [], "t" => [] ];
    $currency = [ 'клоунов', 'приколов', 'рублей', 'слонов', 'багов', 'арбузов' ];

    $lnames = [
        "Наталья",
        "Артур",
        "Вадим",
        "Олег",
        "Аркадий",
        "Алиса",
        "Виктор",
        "Лев",
        "Антон",
        "Денис",
        "Павел",
        "Артём",
        "Даниил",
        "Алла",
        "Светлана",
        "Кирилл",
        "Александра",
        "Борис",
        "Арсений",
        "Валентин",
        "Юрий",
        "Константин",
        "Руслана",
        "Валерия",
        "Виктория",
        "Николай",
        "Матвей",
        "Анжелика",
        "Елена",
        "Алёна",
        "Максим",
        "Диана",
        "Алексей",
        "Вероника",
        "Ольга",
        "Владимир",
        "Мария",
        "Вера",
        "Любовь",
        "Владислав",
        "Сания",
        "Жанна",
        "Елизавета",
        "Надежда",
        "Галина",
        "Кристина",
        "Оксана",
        "Великий",
        "Нина",
        "Ева",
        "Полина",
        "Алина",
        "Марина",
        "Валерий",
        "Руслан",
        "Алёна",
        "Роман",
        "Георгий",
        "Мила",
        "Олеся",
        "Михаил",
        "Виталий",
        "Людмила",
        "Егор",
        "Милана",
        "Яна",
        "Анастасия",
        "Дмитрий",
        "Тимур",
        "Пётр",
        "Иван",
        "Дарья",
        "Юлия",
        "Ника",
        "Игорь",
        "Карина",
        "Григорий",
        "Андрей",
        "Евгений",
        "Александр",
        "Леонид",
        "Ксения",
        "Тамара",
        "Татьяна",
        "Екатерина",
        "Фёдор",
        "Никита",
        "Глеб",
        "Сергей",
        "Евгения",
        "Анатолий",
        "Лариса",
        "София",
        "Маргарита",
        "Василий",
        "Ярослав",
        "Инна",
        "Степан",
        "Ирина",
        "Валентина",
        "Анна",
        "Софья"
    ];

    $fnames = [
        "Смирнов",
        "Лебедев",
        "Кузнецов",
        "Гаврилов",
        "Петров",
        "Афанасьев",
        "Виноградов",
        "Павлов",
        "Николаев",
        "Морозов’",
        "Трофимов",
        "Захаров",
        "Новиков",
        "Воронин",
        "Денисов",
        "Мартынов",
        "Власов",
        "Гусев",
        "Ефимов",
        "Белов",
        "Богданов",
        "Григорьев",
        "Ильин",
        "Покровский",
        "Шульц",
        "Беляев",
        "Дмитриев",
        "Сергеев",
        "Антонов",
        "Макаров",
        "Фёдоров",
        "Карпов",
        "Волков",
        "Соловьёв",
        "Степанов",
        "Михайлов",
        "Леонтьев",
        "Никифоров",
        "Андреев",
        "Иванов",
        "Герасимов",
        "Осипов",
        "Миллер",
        "Марков",
        "Васильев",
        "Соколов",
        "Быков",
        "Егоров",
        "Пономарёв",
        "Комаров",
        "Козлов",
        "Зайцев",
        "Киселёв",
        "Кондратьев",
        "Александров",
        "Максимов",
        "Борисов",
        "Попов",
        "Филиппов",
        "Чистяков",
        "Матвеев",
        "Орлов",
        "Давыдов",
        "Никитин",
        "Сорокин",
        "Яковлев",
        "Кузьмин",
        "Баранов",
        "Сидоров",
        "Тихомиров",
        "Семёнов",
        "Тимофеев",
        "Данилов",
        "Щербаков",
        "Фомин",
        "Шмидт",
        " Наумов",
        "Алексеев",
        "Савельев",
        "Голубев",
        "Воробьёв",
        "Прокофьев",
        "Соболев",
        "Назаров",
        "Кириллов",
        "Миронов",
        "Константинов",
        "Кудрявцев",
        "Крылов",
        "Федотов",
        "Ушаков",
        "Жуков",
        "Абрамов",
        "Титов",
        "Поляков",
        "Троицкий",
        "Львов",
        "Фролов",
        "Игнатьев",
        "Романов"
    ];

    $data = [
        "w" => [ null ],
        "d" => [ true, false ],
        "m" => [
            "мирового кризиса",
            "повышения продаж",
            "как ему тяжело, а разработчики спят"
        ],
        "p" => [ true, false ],
        "t" => [
            random_int(0, 9),
            random_int(0, 99),
            random_int(0, 999)
        ]
    ];

    function checkGirl(string $lname, string $fname)
    {
        return mb_substr($lname, -1) == "а" || mb_substr($lname, -1) == "я" ? $fname."a" : $fname;
    }

    for ($i = 0; $i < sizeof($st); $i++)
        for ($f = 0; $f < random_int(1, 10); $f++)
        {
            $lname = $lnames[random_int(0, 99)]; $fname = $fnames[random_int(0, 99)];
        array_push($objects[$st[$i]], new $status[$i]($lname, checkGirl($lname, $fname), random_int(12000, 250000), $data[$st[$i]][random_int(0, sizeof($data[$st[$i]]) - 1)]));
        }

    //printf("<pre>%s</pre>", print_r($objects, true));
    $total = 0;
    echo "<div>";
    for ($i = 0; $i < sizeof($st); $i++)
    {
        for ($f = 0; $f < sizeof($objects[$st[$i]]); $f++)
        {
            $target = $objects[$st[$i]][$f];
            echo $target->getFI().", должность: ".$target->status.", положение по каръерной лестнице: ".$target->getSocStatus().", зарплата: ".
            $target->getMoney()." ".$currency[random_int(0, sizeof($currency))].", чем занимается: ".$target->work();
            switch($target->$status)
            {
                case "директор":
                    echo ", директор на данный момент ".$target->isVisit()."<br />";
                    break;

                case "программист":
                    echo ", программист на данный момент ".$target->inWork()."<br />";
                    break;

                case "тестировщик":
                    echo ", обнаружено за месяц багов: ".$target->getCountBugs()."<br />";
                    break;

                default:
                    echo "<br />";
                    break;
            }
        }
        echo "<br />Сотрудников в штате: ".$status[$i]::$count."\nОбщая зарплата на штат: ".$status[$i]::$tmoney."<br /><br />";
        $total += $status[$i]::$tmoney;
    }
    echo "</div>";
    echo "<div>Общие затраты организации: ".$total;